use std::convert::From;
use std::str::FromStr;

use hashbrown::HashMap;
use lazy_static::lazy_static;

use crate::{CardInfo, CardStatus, Result};

lazy_static! {
    static ref ERROR_HASHMAP: HashMap<&'static str, (&'static str, &'static str)> = {
        let m: HashMap<&'static str, (&'static str, &'static str)> = [
            ("1", ("44400001", "服务不可用。")),
            ("2", ("44400002", "开发者权限不足。")),
            ("3", ("44400003", "用户权限不足。")),
            ("4", ("44400004", "图片上传失败。")),
            ("5", ("44400005", "HTTP 方法被禁止。")),
            ("6", ("44400006", "编码错误。")),
            ("7", ("44400007", "请求被禁止。")),
            ("8", ("44400008", "服务已经作废。")),
            ("9", ("44400009", "业务逻辑出错。")),
            ("20", ("44400020", "缺少sessionId参数。")),
            ("21", ("44400021", "无效的sessionId 参数。")),
            ("22", ("44400022", "缺少appKey参数。")),
            ("23", ("44400023", "无效的 appKey参数。")),
            ("24", ("44400024", "缺少签名参数。")),
            ("25", ("44400025", "无效签名。")),
            ("26", ("44400026", "缺少方法名参数。")),
            ("27", ("44400027", "不存在的方法名。")),
            ("28", ("44400028", "缺少版本参数。")),
            ("29", ("44400029", "非法的版本参数。")),
            ("30", ("44400030", "不支持的版本号。")),
            ("31", ("44400031", "无效报文格式类型。")),
            ("32", ("44400032", "缺少必选参数。")),
            ("33", ("44400033", "非法的参数。")),
            ("34", ("44400034", "用户调用服务的次数超限。")),
            ("35", ("44400035", "会话调用服务的次数超限。")),
            ("36", ("44400036", "应用调用服务的次数超限。")),
            ("37", ("44400037", "应用调用服务的频率超限。")),
            ("38", ("44400038", "无效IP。")),
            (
                "99",
                (
                    "44400099",
                    "其他错误，接口层捕获未处理异常。",
                ),
            ),
            (
                "390000",
                (
                    "44430000",
                    "业务处理失败，平台发生一般性错误。",
                ),
            ),
            (
                "390100",
                (
                    "44430100",
                    "业务处理失败，查无数据或者数据异常。",
                ),
            ),
            (
                "390101",
                (
                    "44430101",
                    "业务处理失败，查无数据或者数据异常。",
                ),
            ),
            (
                "390102",
                (
                    "44430102",
                    "业务处理失败，查无数据或者数据异常。",
                ),
            ),
            (
                "390103",
                (
                    "44430103",
                    "业务处理失败，查无数据或者数据异常。",
                ),
            ),
            (
                "390104",
                (
                    "44430104",
                    "业务处理失败，查无数据或者数据异常。",
                ),
            ),
            (
                "390200",
                ("44430200", "业务处理失败，网络异常。"),
            ),
            (
                "390201",
                ("44430201", "业务处理失败，网络异常。"),
            ),
            (
                "390202",
                ("44430202", "业务处理失败，网络异常。"),
            ),
            (
                "390203",
                ("44430203", "业务处理失败，网络异常。"),
            ),
            (
                "390204",
                ("44430204", "业务处理失败，网络异常。"),
            ),
            (
                "390300",
                (
                    "44430300",
                    "业务处理失败，第三方接口返回失败。",
                ),
            ),
            (
                "390301",
                (
                    "44430301",
                    "业务处理失败，第三方接口返回失败。",
                ),
            ),
            (
                "390302",
                (
                    "44430302",
                    "业务处理失败，第三方接口返回失败。",
                ),
            ),
            (
                "390303",
                (
                    "44430303",
                    "业务处理失败，第三方接口返回失败。",
                ),
            ),
            (
                "390304",
                (
                    "44430304",
                    "业务处理失败，第三方接口返回失败。",
                ),
            ),
            (
                "390400",
                (
                    "44430400",
                    "业务处理失败，第三方接口返回成功，但缺失数据。",
                ),
            ),
            (
                "390401",
                (
                    "44430401",
                    "业务处理失败，第三方接口返回成功，但缺失数据。",
                ),
            ),
            (
                "390402",
                (
                    "44430402",
                    "业务处理失败，第三方接口返回成功，但缺失数据。",
                ),
            ),
            (
                "390403",
                (
                    "44430403",
                    "业务处理失败，第三方接口返回成功，但缺失数据。",
                ),
            ),
            (
                "390404",
                (
                    "44430404",
                    "业务处理失败，第三方接口返回成功，但缺失数据。",
                ),
            ),
            (
                "390500",
                (
                    "44430500",
                    "业务处理失败，第三方接口返回成功，但数据异常。",
                ),
            ),
            (
                "390501",
                (
                    "44430501",
                    "业务处理失败，第三方接口返回成功，但数据异常。",
                ),
            ),
            (
                "390502",
                (
                    "44430502",
                    "业务处理失败，第三方接口返回成功，但数据异常。",
                ),
            ),
            (
                "390503",
                (
                    "44430503",
                    "业务处理失败，第三方接口返回成功，但数据异常。",
                ),
            ),
            (
                "390504",
                (
                    "44430504",
                    "业务处理失败，第三方接口返回成功，但数据异常。",
                ),
            ),
            (
                "390600",
                (
                    "44430600",
                    "业务处理失败，平台能力调用失败。",
                ),
            ),
            (
                "390700",
                (
                    "44430700",
                    "业务处理失败，能力调用发生错误。",
                ),
            ),
            (
                "390800",
                (
                    "44430800",
                    "业务处理失败，全量查询返回失败。",
                ),
            ),
            (
                "395000",
                (
                    "44435000",
                    "业务处理失败，其它平台数据错误。",
                ),
            ),
            (
                "395001",
                ("44435001", "业务处理失败，平台数据不完整。"),
            ),
            (
                "395002",
                ("44435002", "业务处理失败，平台数据不存在。"),
            ),
            ("395100", ("44435100", "其它输入参数错误。")),
            (
                "395101",
                ("44435101", "业务处理失败，输入参数错误。"),
            ),
            (
                "395102",
                (
                    "44435102",
                    "业务处理失败，请求参数超过批量操作限制。",
                ),
            ),
            (
                "395103",
                (
                    "44435103",
                    "业务处理失败，号码不属于该集团。",
                ),
            ),
            (
                "395104",
                ("44435104", "业务处理失败，集团编码错误。"),
            ),
            (
                "395200",
                (
                    "44435200",
                    "业务处理失败，其它用户状态错误。",
                ),
            ),
            (
                "395201",
                (
                    "44435201",
                    "业务处理失败，测试期用户禁止执行该操作。",
                ),
            ),
            (
                "395202",
                (
                    "44435202",
                    "业务处理失败，沉默期用户禁止执行该操作。",
                ),
            ),
            (
                "395203",
                (
                    "44435203",
                    "业务处理失败，库存期用户禁止执行该操作。",
                ),
            ),
            (
                "395204",
                (
                    "44435204",
                    "业务处理失败，正使用用户禁止执行该操作。",
                ),
            ),
            (
                "395205",
                (
                    "44435205",
                    "业务处理失败，停机用户禁止执行该操作。",
                ),
            ),
            (
                "395206",
                (
                    "44435206",
                    "业务处理失败，预约销户用户禁止执行该操作。",
                ),
            ),
            (
                "395207",
                ("44435207", "业务处理失败，该号码已销户。"),
            ),
            ("395300", ("44435300", "其它用户权限错误。")),
            (
                "395301",
                (
                    "44435301",
                    "业务处理失败，1元/2元月套餐用户不允许进行套餐订购、叠加和修改。",
                ),
            ),
            (
                "395302",
                (
                    "44435302",
                    "业务处理失败，变更套餐超出范围。",
                ),
            ),
            (
                "395303",
                (
                    "44435303",
                    "业务处理失败，单APN用户不允许进行月套餐退订操作。",
                ),
            ),
            (
                "395304",
                (
                    "44435304",
                    "业务处理失败，套餐叠加超出上限。",
                ),
            ),
            (
                "395305",
                (
                    "44435305",
                    "业务处理失败，流量池用户不允许执行该操作。",
                ),
            ),
            (
                "395306",
                (
                    "44435306",
                    "业务处理失败，流量共享用户不允许执行该操作。",
                ),
            ),
            (
                "395307",
                (
                    "44435307",
                    "业务处理失败，该操作与用户现有产品互斥。",
                ),
            ),
            (
                "395308",
                (
                    "44435308",
                    "业务处理失败，平台不开放首个流量套餐订购。",
                ),
            ),
            (
                "395309",
                (
                    "44435309",
                    "业务处理失败，平台不开放该产品办理。",
                ),
            ),
            (
                "395310",
                (
                    "44435310",
                    "业务处理失败，用户无权限订购该产品。",
                ),
            ),
            (
                "395311",
                (
                    "44435311",
                    "业务处理失败，该用户未开通上网功能。",
                ),
            ),
            (
                "395312",
                (
                    "44435312",
                    "业务处理失败，该用户未订购该产品。",
                ),
            ),
        ]
        .iter()
        .cloned()
        .collect();
        m
    };
    static ref STATUS_NAME_HASHMAP: HashMap<&'static str, &'static str> = {
        let m: HashMap<&'static str, &'static str> = [
            ("test", "测试期"),
            ("silent", "沉默期"),
            ("inventory", "库存期"),
            ("normal", "正使用"),
            ("stop", "停机"),
            ("preclose", "销户"),
            ("bespeakClose", "预约销户"),
            ("others", "其他"),
        ]
        .iter()
        .cloned()
        .collect();
        m
    };
}

// 广东移动返回
#[derive(Debug, Default, Serialize, Deserialize)]
#[serde(default, rename_all = "camelCase")]
pub struct CardReply {
    pub code: String,
    pub error: String,
    pub data: String,
}

#[derive(Debug, Default, Serialize, Deserialize)]
#[serde(default, rename_all = "camelCase")]
pub struct CardContent {
    pub code: String,
    pub desc: String,
    pub order_no: String,
    pub status: String,
    pub status_time: String,
    pub iccid: String,
    pub msisdn: String,
    pub imsi: String,
    pub imei: String,
    pub open_time: String,
    pub low_power_mode: String,
    pub main_prod_code: String,
}

impl FromStr for CardReply {
    type Err = crate::errors::Error;
    fn from_str(s: &str) -> Result<Self> {
        let r: Self = serde_json::from_str(s)?;
        if r.code != "0".to_owned() {
            match ERROR_HASHMAP.get(r.code.as_str()) {
                Some(e) => Err(e.to_owned())?,
                None => Err(("44499999", "广东移动未知错误"))?,
            };
        };
        Ok(r)
    }
}

impl FromStr for CardContent {
    type Err = crate::errors::Error;
    fn from_str(s: &str) -> Result<Self> {
        let r: Self = serde_json::from_str(s)?;
        if r.code != "0".to_owned() {
            match ERROR_HASHMAP.get(r.code.as_str()) {
                Some(e) => Err(e.to_owned())?,
                None => Err(("44499999", "广东移动未知错误"))?,
            };
        };
        Ok(r)
    }
}

impl From<CardContent> for CardStatus {
    fn from(s: CardContent) -> Self {
        CardStatus {
            status_code: s.status,
            status_name: "".to_owned(),
            date_activated: s.status_time,
        }
    }
}
